In [1]:
import pandas as pd
data = pd.read_csv('hp_data.csv')
data.head()

,price,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk
0,6300000,BTM Layout,Super built-up Area,1450,Resale,5,1,4,1
1,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3
2,3800000,Whitefield,Super built-up Area,1019,Resale,1,2,5,2
3,10500000,Ambalipura,Super built-up Area,1857,Resale,15,4,5,4
4,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3

In [2]:
from sklearn.preprocessing import LabelEncoder
enc = LabelEncoder()
data.place = enc.fit_transform(data.place)
data.head()

,price,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk
0,6300000,2,Super built-up Area,1450,Resale,5,1,4,1
1,11500000,14,Super built-up Area,2190,Resale,5,3,5,3
2,3800000,12,Super built-up Area,1019,Resale,1,2,5,2
3,10500000,1,Super built-up Area,1857,Resale,15,4,5,4
4,11500000,14,Super built-up Area,2190,Resale,5,3,5,3

In [3]:
pd.DataFrame(enc.classes_)

                           0
0       Abbaiah Reddy Layout
1                 Ambalipura
2                 BTM Layout
3        Devarabeesana Halli
4   Electronics City Phase 1
5                Frazer Town
6                     Gunjur
7                   KR Puram
8               Malleshwaram
9               Rajaji Nagar
10             Sarakki Nagar
11            Subramanyapura
12                Whitefield
13            Yelachenahalli
14                 Yelahanka

In [4]:
X = data.loc[:,['sqft','place','yearsOld','totalFloor','bhk']]
y = data.price

In [5]:
X.head()

   sqft  place  yearsOld  totalFloor  bhk
0  1450      2         5           4    1
1  2190     14         5           5    3
2  1019     12         1           5    2
3  1857      1        15           5    4
4  2190     14         5           5    3

In [6]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

## Model Evaluation

In [7]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,
                                    test_size=0.3,random_state=10)

In [8]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [9]:
y_predict = model.predict(X_test)

In [10]:
from sklearn.metrics import r2_score
r2_score(y_test,y_predict)

0.856064009984307

# Exporting Model

In [11]:
import joblib
joblib.dump(model,'hp_trained_model.pkl') # .pkl pickle

['hp_trained_model.pkl']

http://127.0.0.1:5000/predict?sqft=1500&place=2&yo=5&tf=10&bhk=3